
"""
1. Створіть дискримінатор який має декілька шарів зі зменшенням розмірності зображення і використовує згортувальні та пулінгові шари.
Приймає на вхід зображення цифр MNIST та визначає, чи є це реальне зображення чи згенероване генератором class Generator.
Використовуючи взаємодію генератора та дискримінатора з використанням функції втрат GAN (adversarial loss) навчіть моделі генерувати нові зображення цифр MNIST
2. Після навчання, виведіть кілька згенерованих зображень та порівняйте їх з Оригінальними зображеннями з набору даних MNIST.

"""